{	"ErrorMessages": {		"BaseError": {			"EN": "Something unexpected went wrong. Please try again and if the error persists you can contact the server admins\nError: {0}",			"PT": "Algo inesperado deu errado. Por favor, tente novamente e se o erro persistir, você pode entrar em contato com o administrador do servidor\nError: {0}"		},		"BotAlreadyActiveInChannel": {			"EN": "It is not possible to have multiple MixChannels running within the same channel.",			"PT": "Não é possível ter múltiplos MixChannels operando dentro do mesmo canal."		},		"CaptainInOwnerTeam": {			"EN": "You can not change the captain of the team of the room owner.",			"PT": "Você não pode mudar o capitão da equipe do proprietário da sala."		},		"CaptainNotSubscribed": {			"EN": "The captain need to be subscribed to the mix.",			"PT": "O capitão precisa ser subscrito para a mistura."		},		"CodeAndDisplayValueAreLinkedToDifferentPositions": {			"EN": "Mismatch between both positions: Code: {0} is linked to {1} and displayValue: {2} is linked to {3}.",			"PT": "Portugal Mismatch between both positions: Code: {0} is linked to {1} and displayValue: {2} is linked to {3}."		},		"CommandDisabledError": {			"EN": "This command is not enabled on this server!",			"PT": "Este comando não está habilitado neste servidor!"		},		"CreateSessionError": {			"EN": "Something went wrong while creating a new session after the previous was successfully closed.",			"PT": "Algo deu errado ao criar uma nova sessão depois que a anterior foi encerrada com sucesso."		},		"DiscordChannelIdRequired": {			"EN": "DiscordChannelId is needed to create a MixChannel.",			"PT": "O DiscordChannelId é necessário para criar um MixChannel."		},		"DiscordServerIdRequired": {			"EN": "DiscordServerId is needed to create a MixChannel.",			"PT": "O DiscordServerId é necessário para criar um MixChannel."		},		"FailedToCloseMixGroup": {			"EN": "We could not deactivate the mixGroup.",			"PT": "Não foi possível desativar o mixGroup."		},		"FormationNameRequired": {			"EN": "You have to provide a formationName, it can not be empty.",			"PT": "You have to provide a formationName, it can not be empty."		},		"FormationPosition1GK": {			"EN": "You need to have exactly 1 Gk in your formation.",			"PT": "Você precisa ter exatamente 1 Gk em sua formação."		},		"FormationPositionCount": {			"EN": "The amount of provided positions is not correct, you need to provide 10(excl Gk) or 11 positions.",			"PT": "A quantidade de posições fornecidas não é correta, você precisa fornecer 10(excluído Gk) ou 11 posições."		},		"FormationPositionUnknown": {			"EN": "All positions should exist in the DB.",			"PT": "Todas as posições devem existir no BD."		},		"FormationUnknown": {			"EN": "Formation {0} not found.",			"PT": "Formação {0} não encontrada."		},		"InvalidBoolValue": {			"EN": "This is an invalid value for the boolean.",			"PT": "Este é um valor inválido para o booleano."		},		"InvalidTimesForMixRoom": {			"EN": "The provided times are not valid.",			"PT": "Os horários fornecidos não são válidos."		},		"InvalidTimeValue": {			"EN": "We can not convert this value to a time.",			"PT": "Não podemos converter este valor em um tempo."		},		"NewPositionEmpty": {			"EN": "The position code of the new position can not be empty.",			"PT": "O código de posição da nova posição não pode estar vazio."		},		"NewPositionNotFound": {			"EN": "The new position {0} was not found.",			"PT": "A nova posição {0} não foi encontrada."		},		"NoActiveSessionFoundInChannel": {			"EN": "No active mix session found in this channel.",			"PT": "Nenhuma sessão de mistura ativa encontrada neste canal."		},		"NoChannelFoundForDiscordIds": {			"EN": "No active channel could be found for server: {0}, channelId {1}",			"PT": "Portugal No active channel could be found for server: {0}, channelId {1}"		},		"NoChannelFoundForMixSession": {			"EN": "No mixChannelFound on channel: {0} within server: {1}.",			"PT": "Portugal No mixChannelFound on channel: {0} within server: {1}."		},		"NoFollowUpChannelFound": {			"EN": "We could not create or find a channel to setup a follow mix session.",			"PT": "Não foi possível criar ou encontrar um canal para configurar uma sessão de mixagem de acompanhamento."		},		"NoLockedTeamFoundForCode": {			"EN": "No locked team found for TeamCode",			"PT": "Portugal No locked team found for TeamCode"		},		"NoMixGroupFoundForSession": {			"EN": "No mixGroup found for the session!",			"PT": "Não foi encontrado nenhum mixGroup para a sessão!"		},		"NoOpenPositionsInTeam": {			"EN": "No open positions found in team",			"PT": "Nenhuma posição em aberto encontrada em equipe"		},		"NoOptionProvided": {			"EN": "Please provide at least 1 setting that you want to change.",			"PT": "Por favor, forneça pelo menos 1 configuração que você deseja alterar."		},		"NoPlatformForCodeFound2": {			"EN": "No platform found for: {0} in the database. please check '{1}getplatforms'.",			"PT": "Portugal No platform found for: {0} in the database. please check '{1}getplatforms'."		},		"NoPlatformFoundForCode": {			"EN": "Please provide the code of the platform you want to inspect. No platform found for code: '{0}'.",			"PT": "Favor fornecer o código da plataforma que você deseja inspecionar. Nenhuma plataforma encontrada para código: '{0}'."		},		"NoPositionFoundInTeam": {			"EN": "No (available) position found in team: {0} for position: {1}",			"PT": "Nenhuma posição (disponível) encontrada na equipe: {0} para a posição: {1}"		},		"NotAllowedToDeletePositionCode": {			"EN": "It is not allowed to delete default position code",			"PT": "Portugal It is not allowed to delete default position code"		},		"NoTeamFound": {			"EN": "No team found with code",			"PT": "Nenhuma equipe encontrada com código"		},		"NothingToClose": {			"EN": "There is nothing to close here, you silly nitwit.",			"PT": "Não há nada para fechar aqui, seu idiota idiota."		},		"NoTimeZoneFound": {			"EN": "No TimeZone found",			"PT": "Nenhum TimeZone encontrado"		},		"NoTimeZoneFoundForCode": {			"EN": "No timezone found for",			"PT": "Não foi encontrado um fuso horário para"		},		"OldPositionEmpty": {			"EN": "The position code of the position you want to change with a new one can not be empty.",			"PT": "O código de posição da posição que você deseja mudar com uma nova não pode estar vazio."		},		"OldPositionNotFoundInTeam": {			"EN": "There is no active session in this channel where there is a {0} position in team {1}.",			"PT": "Não há nenhuma sessão ativa neste canal onde há uma posição {0} na equipe {1}."		},		"OnlySessionsWith1ClosedTeamCanBeOpened": {			"EN": "You, the silly Nitwit again, next time try to think before asking me to open a session where {0} teams are open.\nIt is only possible to open a mix with 1 closed team in it!",			"PT": "Você, o bobo Nitwit novamente, da próxima vez tente pensar antes de me pedir para abrir uma sessão onde {0} as equipes estão abertas.só é possível abrir uma mistura com 1 equipe fechada dentro dela!"		},		"OptionMappingError": {			"EN": "Something went wrong while mapping your parameters, {0}",			"PT": "Portugal Something went wrong while mapping your parameters, {0}"		},		"OtherSessionWithinChannel": {			"EN": "There is already an active session within this channel!",			"PT": "Já existe uma sessão ativa dentro deste canal!"		},		"PasswordNotProvidedError": {			"EN": "Please provide a password.",			"PT": "Por favor, forneça uma senha."		},		"PlayerCountValueError": {			"EN": "The player count should be between 1 and 11 players.",			"PT": "A contagem dos jogadores deve estar entre 1 e 11 jogadores."		},		"PlayerCountWithMultipleClosedTeamsWithoutTeamCode": {			"EN": "Please provide a teamCode. ex: {0}PC {1} A",			"PT": "Favor fornecer um teamCode. ex: {0}PC {1} A"		},		"PrivateServerNotAllowedError": {			"EN": "You can not do this in a private chat with the bot.",			"PT": "Você não pode fazer isso em uma conversa particular com o bot."		},		"PropForCreateRequired": {			"EN": "{0} is needed to create a MixChannel.",			"PT": "{0} é necessário para criar um MixChannel."		},		"PropRequired": {			"EN": "{0} is required.",			"PT": "{0} é necessário."		},		"ProvidedPositionUnknown": {			"EN": "There is no position for the code you provided:",			"PT": "Não há posição para o código que você forneceu:"		},		"ProvideTeam": {			"EN": "Please provide a team.",			"PT": "Por favor, forneça uma equipe."		},		"RegistrationWithinValidHours": {			"EN": "You can not sign in at the moment, wait for the session to open up.",			"PT": "Você não pode entrar no momento, aguarde que a sessão se abra."		},		"RoleNotAllowed": {			"EN": "You need to have at least one of the following roles assigned to you:/n{0}",			"PT": "Você precisa ter pelo menos uma das seguintes funções atribuídas a você:/n{0}"		},		"RoomNameNotProvidedError": {			"EN": "Please provide the room name as displayed in the game.",			"PT": "Por favor, forneça o nome da sala como exibido no jogo."		},		"ServerNotProvidedError": {			"EN": "Please provide a game server name.",			"PT": "Por favor, forneça um nome de servidor de jogos."		},		"SwapActiveUsersNotAllowedError": {			"EN": "It is not allowed to use the swap active players command on this server!",			"PT": "Não é permitido usar o comando swap de jogadores ativos neste servidor!"		},		"SwapInactiveUsersError": {			"EN": "Hey retard, Yeah you, It is not possible to swap players that are both not active in this session.",			"PT": "Ei retardado, Sim você, não é possível trocar jogadores que não estão ambos ativos nesta sessão."		},		"SwapInactiveUsersNotAllowedError": {			"EN": "It is not allowed to swap an active player for an inactive player on this server!",			"PT": "Não é permitida a troca de um jogador ativo por um jogador inativo neste servidor!"		},		"SwapWithYourselfIsNotAllowedError": {			"EN": "Hey retard, Yeah you It is not allowed to swap the same user!",			"PT": "Ei retardado, Sim, você Não é permitido trocar o mesmo usuário!"		},			"TagExists": {				"EN": "Tag {0} already exists for position {1}.",				"PT": "Portugal Tag {0} already exists for position {1}."			},			"TeamsWithSameName": {				"EN": "The names of both teams can not be the same.",				"PT": "Os nomes de ambas as equipes não podem ser os mesmos."			},			"UniqueFormationName": {				"EN": "You have to provide a unique formationName.",				"PT": "Portugal You have to provide a unique formationName."			},			"UpdatePositionGK": {				"EN": "You can not change from or to Goalkeeper, you silly nitwit.",				"PT": "Você não pode mudar de Goalkeeper ou para Goalkeeper, seu idiota."			},			"UserActiveInOtherMix": {				"EN": "The user is already active in this or one of the related channels, First sign out, you silly nitwit!",				"PT": "O usuário já está ativo neste ou em um dos canais relacionados, Primeiro saia, seu idiota idiota!"			},			"ValidationValueToLong": {				"EN": "{0} is too long, Max length = {1}.",				"PT": "{0} é muito longo, Comprimento máximo = {1}."			},			"ValueToLong": {				"EN": "Unfortunately this is not the place to write down your personal history.\n**Keep it to maximum {0} characters**/nAlso know that an emoji says more then normal text even to bots like me.",				"PT": "Infelizmente este não é o lugar para anotar sua história pessoal.\n***Cerve-o ao máximo {0} caracteres***/nSaber também que um emoji diz mais que um texto normal até mesmo para bots como eu."			}		}}